xinyew/ESP-IDF_arduino_example/sdkconfig.defaults
CONFIG_AUTOSTART_ARDUINO=y

CONFIG_FREERTOS_HZ=1000

CONFIG_IDF_TARGET="esp32c3"

CONFIG_IDF_TARGET_ESP32C3=y